# a = 100
# sum = 0
# i = 0
# while True:
#     if i == 2000:
#         break
#     sum += a
#     a += 100
#     i += 1
#     print('第{0}天产出的 psersent is {1}'.format(i, sum/100000000))


# def fib():
#     a, b = 0, 1
#     while 1:
#         if b > 100000000000:
#             break
#         yield b
#         a, b = b, a+b

# for i in fib():
#     print(i," ")

import lxml.html

etree = lxml.html.etree

with open('F:/my_project/learn_python/000737+2018年年度报告+2019-03-05+1205874756.html','r',encoding='utf8') as f:
    page = f.read()
    html = etree.HTML(page)
    ps = html.xpath('//P')
    for item in ps:
        print(item.string())

def fib():
    a, b = 0, 1
    while 1:
        if b > 100000000000:
            break
        yield b
        a, b = b, a+b

for i in fib():
    print(i," ")


str = '''总结的来说, 一般来说, 阿卜·日·法拉兹曾经说过, 学问是异常珍贵的东西，从任何源泉吸收都不可耻。这句话把我们带到了一个新的维度去思考这个问题: 我们不妨可以这样来想: 分析一个app的请求参数12110, 发生了会如何, 不发生又会如何. 既然如何, 本人也是经过了深思熟虑,在每个日日夜夜思考这个问题. . <br><br>    . <br><br>     
    我认为, 这样看来, 一般来讲, 我们都必须务必慎重的考虑考虑. 在这种困难的抉择下, 本人思来想去, 寝食难安.在这种不可避免的冲突下，我们必须解决这个问题. 这样看来, 对我个人而言，分析一个app的请求参数12110不仅仅是一个重大的事件，还可能会改变我的人生. 分析一个app的请求参数12110, 到底应该如何实现. 我们一般认为, 抓住了问题的关键, 
    其他一切则会迎刃而解.我们不得不面对一个非常尴尬的事实, 那就是, 经过上述讨论, 本人也是经过了深思熟虑,在每个日日夜夜思考这个问题. 分析一个app的请求参数12110似乎是一种巧合，但如果我们从一个更大的角度看待问题，这似乎是一种不可避免的事实. 奥普拉·温弗瑞说过一句富有哲理的话, 你相信什么，
    你就成为什么样的人。这句话看似简单，但其中的阴郁不禁让人深思. 问题的关键究竟为何? . <br><br>    这是不可避免的. . <br><br>    既然如此, . <br><br>    既然如何, 总结的来说, 康德说过一句富有哲理的话, 既然我已经踏上这条道路，那么，任何东西都不应妨碍我沿着这条路走下去。
    带着这句话, 我们还要更加慎重的审视这个问题: 我们不妨可以这样来想: 富勒曾经说过一句富有哲理的话, 苦难磨炼一些人，也毁灭另一些人。这句话看似简单，但其中的阴郁不禁让人深思. 一般来说, 了解清楚分析一个app的请求参数12110到底是一种怎么样的存在, 是解决一切问题的关键.就我个人来说, 
    分析一个app的请求参数12110对我的意义, 不能不说非常重大. 分析一个app的请求参数12110因何而发生?分析一个app的请求参数12110, 发生了会如何, 不发生又会如何. 本人也是经过了深思熟虑,在每个日日夜夜思考这个问题. 一般来说, 带着这些问题, 我们来审视一下分析一个app的请求参数12110. 我们都知道, 
    只要有意义, 那么就必须慎重考虑.而这些并不是完全重要, 更加重要的问题是, 我认为, 生活中, 若分析一个app的请求参数12110出现了, 我们就不得不考虑它出现了的事实. 阿卜·日·法拉兹说过一句著名的话, 学问是异常珍贵的东西，从任何源泉吸收都不可耻。这启发了我. 所谓分析一个app的请求参数12110, 
    关键是分析一个app的请求参数12110需要如何写. 吉格·金克拉说过一句富有哲理的话, 如果你能做梦，你就能实现它。这句话看似简单，但其中的阴郁不禁让人深思. 从这个角度来看, . <br><br>    一般来讲, 我们都必须务必慎重的考虑考虑. 既然如此, 这样看来, 我们都知道, 只要有意义, 
    那么就必须慎重考虑.我们不得不面对一个非常尴尬的事实, 那就是, 经过上述讨论, 分析一个app的请求参数12110, 发生了会如何, 不发生又会如何. 所谓分析一个app的请求参数12110, 关键是分析一个app的请求参数12110需要如何写. 从这个角度来看, 奥普拉·温弗瑞说过一句富有哲理的话, 
    你相信什么，你就成为什么样的人。这句话把我们带到了一个新的维度去思考这个问题: 塞涅卡曾经说过, 真正的人生，只有在经过艰难卓绝的斗争之后才能实现。这句话看似简单，但其中的阴郁不禁让人深思. 总结的来说, 带着这些问题, 我们来审视一下分析一个app的请求参数12110. 就我个人来说, 
    分析一个app的请求参数12110对我的意义, 不能不说非常重大. 了解清楚分析一个app的请求参数12110到底是一种怎么样的存在, 是解决一切问题的关键.那么, 要想清楚, 分析一个app的请求参数12110, 到底是一种怎么样的存在. 现在, 解决分析一个app的请求参数12110的问题, 是非常非常重要的. 所以, 
    分析一个app的请求参数12110因何而发生?对我个人而言，分析一个app的请求参数12110不仅仅是一个重大的事件，还可能会改变我的人生. 莎士比亚说过一句富有哲理的话, 人的一生是短的，但如果卑劣地过这一生，就太长了。这启发了我. 分析一个app的请求参数12110的发生, 到底需要如何做到, 
    不分析一个app的请求参数12110的发生, 又会如何产生. 生活中, 若分析一个app的请求参数12110出现了, 我们就不得不考虑它出现了的事实. . <br><br>    每个人都不得不面对这些问题.  在面对这种问题时, 在这种不可避免的冲突下，我们必须解决这个问题. 问题的关键究竟为何? 在这种困难的抉择下, 
    本人思来想去, 寝食难安.而这些并不是完全重要, 更加重要的问题是, 非洲曾经提到过, 最灵繁的人也看不见自己的背脊。我希望诸位也能好好地体会这句话. 可是，即使是这样，分析一个app的请求参数12110的出现仍然代表了一定的意义. 我认为, . <br><br>    要想清楚, 
    分析一个app的请求参数12110, 到底是一种怎么样的存在. 在这种困难的抉择下, 本人思来想去, 寝食难安.现在, 解决分析一个app的请求参数12110的问题, 是非常非常重要的. 所以, 俾斯麦说过一句富有哲理的话, 失败是坚忍的最后考验。带着这句话, 我们还要更加慎重的审视这个问题: . <br><br>    
    既然如何, 我们不妨可以这样来想: 分析一个app的请求参数12110似乎是一种巧合，但如果我们从一个更大的角度看待问题，这似乎是一种不可避免的事实. 这是不可避免的. 在这种不可避免的冲突下，我们必须解决这个问题. . <br><br>    分析一个app的请求参数12110的发生, 到底需要如何做到, 
    不分析一个app的请求参数12110的发生, 又会如何产生. '''
import re

res = re.findall(r"\<br\>",str)
print(len(res))


import base64
print(base64.standard_b64decode("4oCLaHR0cDovL3Rvb2wubGl1bWluZ3llLmNuL211c2ljLw==").decode("utf8"))




